app/views/users/edit.html.erb

      <div class="form-check">
        <%= check_box_tag 'permission_ids[]', permission.id, @user.permissions.include?(permission), class: 'form-check-input', id: "permission_#{permission.id}" %>
---
SELECT "permissions".* FROM "permissions"
SELECT 1 AS one FROM "permissions" INNER JOIN "user_permissions" ON "permissions"."id" = "user_permissions"."permission_id" WHERE "user_permissions"."user_id" = 4 AND "permissions"."id" = 1 LIMIT 1