app/views/users/show.html.erb

        <ul>
          <% @user.permissions.each do |permission| %>
---
SELECT "permissions".* FROM "permissions" INNER JOIN "user_permissions" ON "permissions"."id" = "user_permissions"."permission_id" WHERE "user_permissions"."user_id" = 4