app/views/records/edit.html.erb

SELECT "permissions".* FROM "permissions"
SELECT 1 AS one FROM "permissions" INNER JOIN "record_permissions" ON "permissions"."id" = "record_permissions"."permission_id" WHERE "record_permissions"."record_id" = 2 AND "permissions"."id" = 1 LIMIT 1
---
      <div class="form-check">
        <%= check_box_tag 'permission_ids[]', permission.id, @record.permissions.include?(permission), class: 'form-check-input', id: "permission_#{permission.id}" %>

SELECT "documents".* FROM "documents" WHERE "documents"."record_id" = 2
---
    <ul class="list-group">
      <% @record.documents.each do |document| %>