app/views/records/show.html.erb

SELECT "permissions".* FROM "permissions" INNER JOIN "record_permissions" ON "permissions"."id" = "record_permissions"."permission_id" WHERE "record_permissions"."record_id" = 1
---
        <ul>
          <% @record.permissions.each do |permission| %>

SELECT "documents".* FROM "documents" WHERE "documents"."record_id" = 1
---
        <ul>
          <% @record.documents.each do |document| %>