app/controllers/dashboard_controller.rb

  def index
    @user = current_user

    case @user.role
    when 'admin'
      @users_count = User.count
      @records_count = Record.count
      @circles_count = Circle.count
      @branches_count = Branch.count
    when 'circle_admin'
      @branches = @user.circle.branches
      @records_count = Record.where(circle: @user.circle).count
    when 'checker'
      @unverified_records = Record.where(branch: @user.branch, verified: false)
---
SELECT COUNT(*) FROM "users"
SELECT COUNT(*) FROM "records"
SELECT COUNT(*) FROM "circles"
SELECT COUNT(*) FROM "branches"
SELECT "records".* FROM "records" WHERE "records"."branch_id" = 1 AND "records"."verified" = FALSE
SELECT "branches".* FROM "branches" WHERE "branches"."id" = 1 LIMIT 1