app/controllers/permissions_controller.rb

SELECT "permissions".* FROM "permissions" ORDER BY "permissions"."title" ASC
---
  def index
    @permissions = Permission.order(:title)