app/controllers/records_controller.rb

  def index
    @records = case current_user.role
               when 'admin'
                 Record.includes(:circle, :branch, :created_by).order(created_at: :desc)
---
SELECT "records".* FROM "records" WHERE "records"."created_by_id" = 3 ORDER BY "records"."created_at" DESC

  def new
    @record = Record.new
    @circles = Circle.active
    @branches = Branch.active
    @permissions = Permission.all
---
SELECT "permissions".* FROM "permissions"

  def create
    @record = Record.new(record_params)
    @record.created_by = current_user

    if @record.save
      # Assign permissions
      if params[:permission_ids].present?
        params[:permission_ids].each do |permission_id|
          @record.record_permissions.create(permission_id: permission_id)
        end
      end

      # Handle file uploads
      if params[:documents].present?
        params[:documents].each do |file|
          document = @record.documents.build(
            file: file,
            uploaded_by: current_user
          )

          unless document.save
---
INSERT INTO "records" ("title", "description", "circle_id", "branch_id", "created_by_id", "verified_by_id", "verified", "objected", "objection_reason", "verified_at", "created_at", "updated_at") VALUES ('Abc', 'dssdc', 1, 1, 3, NULL, FALSE, FALSE, NULL, NULL, '2025-11-09 10:22:27.937014', '2025-11-09 10:22:27.937014') RETURNING "id"
INSERT INTO "record_permissions" ("record_id", "permission_id", "created_at", "updated_at") VALUES (1, 1, '2025-11-09 10:22:27.951486', '2025-11-09 10:22:27.951486') RETURNING "id"
INSERT INTO "documents" ("record_id", "filename", "file_path", "content_type", "file_size", "sha256_hash", "uploaded_by_id", "created_at", "updated_at") VALUES (2, '9789352139736_toc.pdf', '/home/lappy/workspace/projects/mis/storage/documents/2/1762684643_32f114be6_9789352139736_toc.pdf', 'application/pdf', 184026, '32f114be6c6a1de4bed8a7063c08bd0ff406eedccb8556e7953c6521cf8ecc34', 3, '2025-11-09 10:37:23.284831', '2025-11-09 10:37:23.284831') RETURNING "id"

  def edit
    @circles = Circle.active
    @branches = Branch.active
    @permissions = Permission.all
---
SELECT "permissions".* FROM "permissions"

  def update
    if @record.update(record_params)
      # Can only add new permissions, not remove existing ones
      if params[:permission_ids].present?
        params[:permission_ids].each do |permission_id|
          @record.record_permissions.find_or_create_by(permission_id: permission_id)
        end
      end

      # Handle new file uploads (can only add, not remove)
      if params[:documents].present?
---
SELECT "record_permissions".* FROM "record_permissions" WHERE "record_permissions"."record_id" = 1
SELECT "documents".* FROM "documents" WHERE "documents"."record_id" = 1

  def destroy
    @record.destroy
---
DELETE FROM "records" WHERE "records"."id" = 1

  def verify
    if current_user.checker?
      @record.update(
        verified: true,
        verified_by: current_user,
        verified_at: Time.current
      )
---
UPDATE "records" SET "verified_by_id" = 4, "verified" = TRUE, "verified_at" = '2025-11-09 10:38:08.303735', "updated_at" = '2025-11-09 10:38:08.304162' WHERE "records"."id" = 1

  def set_record
    @record = Record.find(params[:id])
---
SELECT "records".* FROM "records" WHERE "records"."id" = 1 LIMIT 1