app/controllers/sessions_controller.rb

  def create
    user = User.find_by(email: params[:email])

    if user && user.authenticate(params[:password])
      if user.can_access?
        session[:user_id] = user.id
        user.update(last_login_at: Time.current)
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'admin@example.com' LIMIT 1
UPDATE "users" SET "last_login_at" = '2025-11-09 08:22:49.234269', "updated_at" = '2025-11-09 08:22:49.238163' WHERE "users"."id" = 1