app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC
---
  def index
    @users = User.includes(:circle, :branch).order(created_at: :desc)

SELECT "permissions".* FROM "permissions"
---
  def new
    @user = User.new
    @circles = Circle.active
    @branches = Branch.active
    @permissions = Permission.all

SELECT "permissions".* FROM "permissions"
---
  def edit
    @circles = Circle.active
    @branches = Branch.active
    @permissions = Permission.all